## Production
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

**⚠️ &nbsp; Warning:** resources will be destroyed by this change!
```terraform
Plan: 8 to add, 0 to change, 3 to destroy
```

<details>
<summary>Show summary</summary>

| CHANGE |                                              RESOURCE                                               |
|--------|-----------------------------------------------------------------------------------------------------|
| add    | `aws_cloudwatch_log_subscription_filter.superset_role_grant`                                        |
|        | `module.sentinel_forwarder.aws_cloudwatch_log_group.sentinel_forwarder_lambda`                      |
|        | `module.sentinel_forwarder.aws_iam_policy.sentinel_forwarder_lambda`                                |
|        | `module.sentinel_forwarder.aws_iam_role.sentinel_forwarder_lambda`                                  |
|        | `module.sentinel_forwarder.aws_iam_role_policy_attachment.sentinel_forwarder_lambda`                |
|        | `module.sentinel_forwarder.aws_lambda_function.sentinel_forwarder`                                  |
|        | `module.sentinel_forwarder.aws_lambda_permission.sentinel_forwarder_cloudwatch_log_subscription[0]` |
|        | `module.sentinel_forwarder.aws_ssm_parameter.sentinel_forwarder_auth`                               |
| delete | `aws_cloudwatch_log_metric_filter.superset_privileged_role_grant`                                   |
|        | `aws_cloudwatch_metric_alarm.superset_privileged_role_grant`                                        |
|        | `aws_cloudwatch_query_definition.superset_privileged_role_grant`                                    |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create
  - destroy
 <= read (data resources)

Terraform will perform the following actions:

  # aws_cloudwatch_log_metric_filter.superset_privileged_role_grant will be destroyed
  # (because aws_cloudwatch_log_metric_filter.superset_privileged_role_grant is not in configuration)
  - resource "aws_cloudwatch_log_metric_filter" "superset_privileged_role_grant" {
      - id             = "privileged-role-grant" -> null
      - log_group_name = "/aws/rds/cluster/superset-prod-cluster/postgresql" -> null
      - name           = "privileged-role-grant" -> null
      - pattern        = (sensitive value) -> null
      - region         = "ca-central-1" -> null

      - metric_transformation {
          - default_value = "0" -> null
          - name          = "privileged-role-grant" -> null
          - namespace     = "superset" -> null
          - unit          = "None" -> null
          - value         = "1" -> null
        }
    }

  # aws_cloudwatch_log_subscription_filter.superset_role_grant will be created
  + resource "aws_cloudwatch_log_subscription_filter" "superset_role_grant" {
      + destination_arn = (known after apply)
      + distribution    = "Random"
      + filter_pattern  = "INSERT INTO ab_user_role"
      + id              = (known after apply)
      + log_group_name  = "/aws/rds/cluster/superset-prod-cluster/postgresql"
      + name            = "Superset role grant"
      + region          = "ca-central-1"
      + role_arn        = (known after apply)
    }

  # aws_cloudwatch_metric_alarm.superset_privileged_role_grant will be destroyed
  # (because aws_cloudwatch_metric_alarm.superset_privileged_role_grant is not in configuration)
  - resource "aws_cloudwatch_metric_alarm" "superset_privileged_role_grant" {
      - actions_enabled                       = true -> null
      - alarm_actions                         = [
          - "arn:aws:sns:ca-central-1:066023111852:cloudwatch-alert-warning",
        ] -> null
      - alarm_description                     = "Privileged role was granted in Superset." -> null
      - alarm_name                            = "privileged-role-grant" -> null
      - arn                                   = "arn:aws:cloudwatch:ca-central-1:066023111852:alarm:privileged-role-grant" -> null
      - comparison_operator                   = "GreaterThanThreshold" -> null
      - datapoints_to_alarm                   = 0 -> null
      - evaluation_periods                    = 1 -> null
      - id                                    = "privileged-role-grant" -> null
      - metric_name                           = "privileged-role-grant" -> null
      - namespace                             = "superset" -> null
      - ok_actions                            = [
          - "arn:aws:sns:ca-central-1:066023111852:cloudwatch-alert-ok",
        ] -> null
      - period                                = 60 -> null
      - region                                = "ca-central-1" -> null
      - statistic                             = "Sum" -> null
      - tags                                  = {
          - "CostCentre" = "cds-superset-prod"
          - "Terraform"  = "true"
        } -> null
      - tags_all                              = {
          - "CostCentre" = "cds-superset-prod"
          - "Terraform"  = "true"
        } -> null
      - threshold                             = 0 -> null
      - treat_missing_data                    = "notBreaching" -> null
        # (4 unchanged attributes hidden)
    }

  # aws_cloudwatch_query_definition.superset_privileged_role_grant will be destroyed
  # (because aws_cloudwatch_query_definition.superset_privileged_role_grant is not in configuration)
  - resource "aws_cloudwatch_query_definition" "superset_privileged_role_grant" {
      - id                  = "22c7fcf8-e14f-4457-9833-fe4907941bc2" -> null
      - log_group_names     = [
          - "/aws/rds/cluster/superset-prod-cluster/postgresql",
        ] -> null
      - name                = "Superset - privileged role grant" -> null
      - query_definition_id = "22c7fcf8-e14f-4457-9833-fe4907941bc2" -> null
      - query_string        = (sensitive value) -> null
      - region              = "ca-central-1" -> null
    }

  # module.sentinel_forwarder.data.aws_iam_policy_document.sentinel_forwarder_lambda will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "sentinel_forwarder_lambda" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "logs:CreateLogStream",
              + "logs:PutLogEvents",
            ]
          + effect    = "Allow"
          + resources = [
              + (known after apply),
            ]
        }
      + statement {
          + actions   = [
              + "xray:GetSamplingRules",
              + "xray:GetSamplingStatisticSummaries",
              + "xray:GetSamplingTargets",
              + "xray:PutTelemetryRecords",
              + "xray:PutTraceSegments",
            ]
          + effect    = "Allow"
          + resources = [
              + "*",
            ]
        }
      + statement {
          + actions   = [
              + "ssm:GetParameter",
              + "ssm:GetParameters",
            ]
          + effect    = "Allow"
          + resources = [
              + (known after apply),
            ]
        }
    }

  # module.sentinel_forwarder.aws_cloudwatch_log_group.sentinel_forwarder_lambda will be created
  + resource "aws_cloudwatch_log_group" "sentinel_forwarder_lambda" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + log_group_class   = (known after apply)
      + name              = "/aws/lambda/sentinel-forwarder"
      + name_prefix       = (known after apply)
      + region            = "ca-central-1"
      + retention_in_days = 14
      + skip_destroy      = false
      + tags              = {
          + "CostCentre" = "cds-superset-prod"
        }
      + tags_all          = {
          + "CostCentre" = "cds-superset-prod"
        }
    }

  # module.sentinel_forwarder.aws_iam_policy.sentinel_forwarder_lambda will be created
  + resource "aws_iam_policy" "sentinel_forwarder_lambda" {
      + arn              = (known after apply)
      + attachment_count = (known after apply)
      + id               = (known after apply)
      + name             = "SentinelForwarderLambda-sentinel-forwarder"
      + name_prefix      = (known after apply)
      + path             = "/"
      + policy           = (known after apply)
      + policy_id        = (known after apply)
      + tags_all         = (known after apply)
    }

  # module.sentinel_forwarder.aws_iam_role.sentinel_forwarder_lambda will be created
  + resource "aws_iam_role" "sentinel_forwarder_lambda" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "lambda.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "SentinelForwarderLambda-sentinel-forwarder"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # module.sentinel_forwarder.aws_iam_role_policy_attachment.sentinel_forwarder_lambda will be created
  + resource "aws_iam_role_policy_attachment" "sentinel_forwarder_lambda" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "SentinelForwarderLambda-sentinel-forwarder"
    }

  # module.sentinel_forwarder.aws_lambda_function.sentinel_forwarder will be created
  + resource "aws_lambda_function" "sentinel_forwarder" {
      + architectures                  = (known after apply)
      + arn                            = (known after apply)
      + code_sha256                    = (known after apply)
      + description                    = "Lambda function to forward AWS logs to Azure Sentinel"
      + filename                       = "/tmp/sentinel_forwarder.py.zip"
      + function_name                  = "sentinel-forwarder"
      + handler                        = "sentinel_forwarder.lambda_handler"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + layers                         = [
          + "arn:aws:lambda:ca-central-1:283582579564:layer:aws-sentinel-connector-layer:216",
        ]
      + memory_size                    = 128
      + package_type                   = "Zip"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + qualified_invoke_arn           = (known after apply)
      + region                         = "ca-central-1"
      + reserved_concurrent_executions = -1
      + role                           = (known after apply)
      + runtime                        = "python3.9"
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + skip_destroy                   = false
      + source_code_hash               = "mfdZfYUgPWLo+yh9aU8f33p2Tg+J0YOaJr3kKgPNVhE="
      + source_code_size               = (known after apply)
      + tags                           = {
          + "CostCentre" = "cds-superset-prod"
        }
      + tags_all                       = {
          + "CostCentre" = "cds-superset-prod"
        }
      + timeout                        = 30
      + version                        = (known after apply)

      + environment {
          + variables = (known after apply)
        }

      + ephemeral_storage (known after apply)

      + logging_config (known after apply)

      + tracing_config {
          + mode = "Active"
        }
    }

  # module.sentinel_forwarder.aws_lambda_permission.sentinel_forwarder_cloudwatch_log_subscription[0] will be created
  + resource "aws_lambda_permission" "sentinel_forwarder_cloudwatch_log_subscription" {
      + action              = "lambda:InvokeFunction"
      + function_name       = "sentinel-forwarder"
      + id                  = (known after apply)
      + principal           = "logs.ca-central-1.amazonaws.com"
      + region              = "ca-central-1"
      + source_arn          = "arn:aws:logs:ca-central-1:066023111852:log-group:/aws/rds/cluster/superset-prod-cluster/postgresql:*"
      + statement_id        = "AllowExecutionFromCloudWatchLogs-sentinel-forwarder-0"
      + statement_id_prefix = (known after apply)
    }

  # module.sentinel_forwarder.aws_ssm_parameter.sentinel_forwarder_auth will be created
  + resource "aws_ssm_parameter" "sentinel_forwarder_auth" {
      + arn            = (known after apply)
      + data_type      = (known after apply)
      + has_value_wo   = (known after apply)
      + id             = (known after apply)
      + insecure_value = (known after apply)
      + key_id         = (known after apply)
      + name           = "sentinel-forwarder-auth"
      + region         = "ca-central-1"
      + tags           = {
          + "CostCentre" = "cds-superset-prod"
        }
      + tags_all       = {
          + "CostCentre" = "cds-superset-prod"
        }
      + tier           = (known after apply)
      + type           = "SecureString"
      + value          = (sensitive value)
      + version        = (known after apply)
    }

Plan: 8 to add, 0 to change, 3 to destroy.

Warning: Deprecated attribute

  on .terraform/modules/athena_access_logs/athena_access_logs/locals.tf line 6, in locals:
   6:   region     = data.aws_region.current.name

The attribute "name" is deprecated. Refer to the provider documentation for
details.

(and 16 more similar warnings elsewhere)

Warning: Argument is deprecated

  with module.athena_bucket.aws_s3_bucket.this,
  on .terraform/modules/athena_bucket/S3/main.tf line 8, in resource "aws_s3_bucket" "this":
   8: resource "aws_s3_bucket" "this" {

lifecycle_rule is deprecated. Use the aws_s3_bucket_lifecycle_configuration
resource instead.

(and 8 more similar warnings elsewhere)

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"
Releasing state lock. This may take a few moments...

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_athena_data_catalog.data_lake[\"production\"]"]
WARN - plan.json - main - Missing Common Tags: ["aws_elasticache_subnet_group.superset_cache"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_role.superset_waf_logs"]
WARN - plan.json - main - Missing Common Tags: ["aws_kinesis_firehose_delivery_stream.superset_waf_logs"]
WARN - plan.json - main - Missing Common Tags: ["aws_wafv2_regex_pattern_set.label_sizerestrictions_body_excluded_paths"]
WARN - plan.json - main - Missing Common Tags: ["module.sentinel_forwarder.aws_cloudwatch_log_group.sentinel_forwarder_lambda"]
WARN - plan.json - main - Missing Common Tags: ["module.sentinel_forwarder.aws_iam_policy.sentinel_forwarder_lambda"]
WARN - plan.json - main - Missing Common Tags: ["module.sentinel_forwarder.aws_iam_role.sentinel_forwarder_lambda"]
WARN - plan.json - main - Missing Common Tags: ["module.sentinel_forwarder.aws_lambda_function.sentinel_forwarder"]
WARN - plan.json - main - Missing Common Tags: ["module.sentinel_forwarder.aws_ssm_parameter.sentinel_forwarder_auth"]

29 tests, 19 passed, 10 warnings, 0 failures, 0 exceptions

```

</details>
